# Importing libraries

In [1]:
import pandas as pd
import numpy as np
import os

# Importing path

In [2]:
path = r'/Users/heatherstewart/Dropbox/Mac/Desktop/Instacart Basket analysis 3'

In [3]:
path

'/Users/heatherstewart/Dropbox/Mac/Desktop/Instacart Basket analysis 3'

# Importing customer dataframe

In [4]:
df_cust = pd.read_csv(os.path.join(path,'02 Data','Original Data','customers.csv'),index_col = False)

In [5]:
df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [6]:
# Printing shape of df_cust dataframe

df_cust.shape

(206209, 10)

In [7]:
# Printing statistic for df_cust dataframe

df_cust.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [8]:
# Addressing missing values

df_cust.isnull().sum()

user_id             0
First Name      11259
Surnam              0
Gender              0
STATE               0
Age                 0
date_joined         0
n_dependants        0
fam_status          0
income              0
dtype: int64

In [9]:
# Creating a subset and Using isnull() function to address missing values- creating a subset to drop missing values (NaN) of "First Name"

cust_2 = df_cust[df_cust['First Name'].isnull() == False]

In [10]:
cust_2.isnull().sum()

user_id         0
First Name      0
Surnam          0
Gender          0
STATE           0
Age             0
date_joined     0
n_dependants    0
fam_status      0
income          0
dtype: int64

In [11]:
# Checking for duplicate values

df_dups = df_cust[df_cust.duplicated()]

In [12]:
df_dups

Empty DataFrame
Columns: [user_id, First Name, Surnam, Gender, STATE, Age, date_joined, n_dependants, fam_status, income]
Index: []

##There are no duplicates located within the dataframe

In [13]:
# looping to address mix type variables

for col in df_cust.columns.tolist():
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cust[weird]) > 0:
    print (col)

First Name

In [14]:
for col in df_cust.columns.tolist():
    print (col)

user_id
First Name
Surnam
Gender
STATE
Age
date_joined
n_dependants
fam_status
income

In [14]:
df_cust['First Name'] = df_cust['First Name'].astype('str')

In [15]:
# Renaming columns 

df_cust.rename(columns = {'user_id':'customer_id','First Name': 'first_name', 'STATE': 'state','Surnam': 'sirname','Gender':'gender','Age':'customer_age'}, inplace =True)

In [16]:
df_cust.head()

,customer_id,first_name,sirname,gender,state,customer_age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# Importing ords_prods dataframe

In [16]:
ords_prods = pd.read_pickle(os.path.join(path,'02 Data','Prepared Data','ords_prods_groupby_pkl'))

In [17]:
#Splitting the dataframe by using randomonization.

np.random.seed(42)
dev = np.random.rand(len(ords_prods))<=0.7

In [18]:
# Creating a small subset (30%)of the dataframe 

small = ords_prods[~dev]

In [19]:
small.head()

,order_id,customer_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,prices,_merge,price_range_loc,Busiest days,max_order,loyalty_flag,average_price,spending_flag,regularity,order_frequency_flag
1,2398795,1,2,3,Average orders,15.0,196,1,1,Soda,...,9.0,both,Mid_range product,Regularly busy,10,New customer,6.367797,Low spender,21.0,Non-frequent customer
2,473747,1,3,3,Average orders,21.0,196,1,1,Soda,...,9.0,both,Mid_range product,Regularly busy,10,New customer,6.367797,Low spender,21.0,Non-frequent customer
7,3108588,1,8,1,Average orders,14.0,196,2,1,Soda,...,9.0,both,Mid_range product,Busiest days,10,New customer,6.367797,Low spender,21.0,Non-frequent customer
9,2550362,1,10,4,Average orders,30.0,196,1,1,Soda,...,9.0,both,Mid_range product,Regularly busy,10,New customer,6.367797,Low spender,21.0,Non-frequent customer
11,1870022,15,17,2,Average orders,8.0,196,6,1,Soda,...,9.0,both,Mid_range product,Regularly busy,22,Regular customer,3.980556,Low spender,12.0,Regular customer

In [ ]:
ords_prods['order_hour_of_day'].mean()

In [ ]:
ords_prods['order_hour_of_day'].median()

In [ ]:
ords_prods['order_hour_of_day'].max()

In [ ]:
# Checking for missing data in ords_prods dataframe

ords_prods.isnull().sum()

In [ ]:
# Checking statistic of ords_prods dataframe

ords_prods.describe()

# Merging both dataframe

In [20]:
df_combo_all = df_cust.merge(small, on = ['customer_id'])

In [21]:
df_combo_all.head()

,customer_id,first_name,sirname,gender,state,customer_age,date_joined,n_dependants,fam_status,income,...,prices,_merge,price_range_loc,Busiest days,max_order,loyalty_flag,average_price,spending_flag,regularity,order_frequency_flag
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,9.0,both,Mid_range product,Regularly busy,8,New customer,7.988889,Low spender,20.0,Regular customer
1,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,12.6,both,Mid_range product,Regularly busy,8,New customer,7.988889,Low spender,20.0,Regular customer
2,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,12.6,both,Mid_range product,Busiest days,8,New customer,7.988889,Low spender,20.0,Regular customer
3,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,4.3,both,Low_range product,Busiest days,8,New customer,7.988889,Low spender,20.0,Regular customer
4,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285,...,9.0,both,Mid_range product,Busiest days,12,Regular customer,7.057534,Low spender,26.0,Non-frequent customer

In [22]:
# Viewing shape of df_combo_all dataframe

df_combo_all.shape

(9726566, 31)

# Exporting the df_combo_all dataframe

In [23]:
# Exporting dataframe as pickle 

df_combo_all.to_pickle(os.path.join(path, '02 Data', 'Prepared Data','df_combo_all.pkl'))